/*
https://babeljs.io/docs/en/usage - док по установке

npm install --save-dev @babel/core @babel/cli @babel/preset-env  - установка npm

ну тут все понятно, устанавливаем и ставим флаг save dev типо нужен бабел нам ток во время разработки
далее идут пакеты
@babel/core - @babel - значит что относится к опр пакету babel. core - это основной пакет который прогоняет наш весь код
@babel/cli - как и с другими пакетами, в приципе у любого пакета cli это значит запуск через терминал.
@babel/preset-env  - это пресет опр настроек. На сайте есть разные пресеты. env -это базовы который подходит в бол случаев
*/